app/views/admin/addresses/index.html.erb

				<td><%= address.zip_code %></td>
				<td><%= link_to "#{address.user.first_name} #{address.user.last_name}", admin_user_path(address.user.id) %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2295]]