app/views/dashboard/index.html.erb

				<!--List of all categories-->
				<%= collection_select(:category, :name, Category.all, :id, :name, { prompt: true }, { name: "filter_category", class: "form-control" }) %>
---
SELECT "categories".* FROM "categories"