app/controllers/admin/addresses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2304]]
SELECT "addresses".* FROM "addresses"
---
	def index
		if check_search_user
			@valid_search_user = true
			@addresses = User.find(params[:search_user_id]).addresses
		else
			@valid_search_user = false
			@addresses = Address.all