app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"
---
	def index
		save_referer_to_session
		@categories = Category.all