app/controllers/admin/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2304]]
SELECT  SUM(price * quantity) AS total_revenue FROM "orders" JOIN products ON order_contents.product_id = products.id JOIN order_contents ON orders.id = order_contents.order_id WHERE (order_id = 3545)  ORDER BY "orders"."id" ASC LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2304]]
SELECT  "orders".* FROM "orders" LIMIT 100
SELECT "users"."id" FROM "users"
---
	def index
		save_referer_to_session
		if check_search_user
			@valid_search_user = true
			@orders = User.find(params[:search_user_id]).orders
		else
			@valid_search_user = false
			@orders = Order.all.limit(100)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 3853]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 5801]]
SELECT  "credit_cards".* FROM "credit_cards" WHERE (user_id = 2304)  ORDER BY "credit_cards"."id" ASC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2304]]
SELECT "order_contents".* FROM "order_contents" WHERE (order_id = 3853)
---
	def show
		save_referer_to_session
		@order = Order.find(params[:id])
		@shipping_address = Address.find(@order.shipping_id)
		@billing_address = Address.find(@order.billing_id)
		@credit_card = CreditCard.where("user_id = #{@order.user_id}").first
		@order_items = OrderContents.where("order_id = #{@order.id}")