app/controllers/admin/products_controller.rb

	def show
		@product = Product.find(id = params[:id])
		@category = category_name(@product)
		@orders = @product.orders.where("checkout_date IS NOT null").count
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1290]]
SELECT COUNT(*) FROM "orders" INNER JOIN "order_contents" ON "orders"."id" = "order_contents"."order_id" WHERE "order_contents"."product_id" = ? AND ("orders"."checkout_date" IS NOT NULL)  [["product_id", 1290]]