app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		save_referer_to_session
		@users = User.all