app/views/admin/dashboard/_order_statistics.html.erb

SELECT  SUM(products.price * order_contents.quantity) AS order_value, COUNT(DISTINCT order_contents.order_id) AS number_of_orders FROM "orders" JOIN users ON users.id = orders.user_id JOIN order_contents ON orders.id = order_contents.order_id JOIN products ON order_contents.product_id = products.id WHERE (orders.checkout_date IS NOT null) AND (orders.checkout_date >= '2015-07-23 15:32:17.435746')  ORDER BY "orders"."id" ASC LIMIT 1
---
			<td>Largest Order Value:</td>
			<td><%= number_to_currency(Order.highest_order_value.order_price) %></td>

SELECT COUNT(*) FROM "orders" WHERE (checkout_date >= '2015-07-23 15:32:17.433634') AND (checkout_date NOT null)
---
			<td>Number of Orders:</td>
			<td><%= Order.total_submitted_orders{Order.where("checkout_date >= ?",1.week.ago)} %></td>