app/views/admin/dashboard/_overall_platform.html.erb

SELECT COUNT(*) FROM "users" WHERE (created_at >= '2015-07-23 15:32:17.394252')
---
			<td>Total Users:</td>
			<td><%= User.total{User.where("created_at >= ?",1.week.ago)} %></td>

SELECT COUNT(*) FROM "orders" WHERE (checkout_date >= '2015-07-23 15:32:17.396639') AND (checkout_date NOT null)
---
			<td>Total Submitted Orders:</td>
			<td><%= Order.total_submitted_orders{Order.where("checkout_date >= ?",1.week.ago)} %></td>

SELECT COUNT(*) FROM "products" WHERE (created_at >= '2015-07-23 15:32:17.397448')
---
			<td>Total Products Listed:</td>
			<td><%= Product.total_product{Product.where("created_at >= ?",1.week.ago)} %></td>