app/views/admin/orders/index.html.erb

				<td><%= link_to order.user.id, admin_user_path(order.user) %></td>
				<td><%= Address.find(order.shipping_id).street_address %></td>
				<td><%= Address.find(order.shipping_id).city.name %></td>
				<td><%= Address.find(order.shipping_id).state.name %></td>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 5718]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 2209]]
SELECT  "states".* FROM "states" WHERE "states"."id" = ? LIMIT 1  [["id", 1116]]