app/views/admin/orders/show.html.erb

			<td>Customer:</td>
			<td><%= link_to "#{@order.user.first_name} #{@order.user.last_name}", admin_user_path(@order.user_id) %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2304]]