app/views/users/_user_address_form.html.erb

SELECT "cities".* FROM "cities"
---
			<div class="form-group">
		    <%= address_fields.collection_select(:city_id, City.all, :id, :name, {prompt: true}, {class: "form-control"}) %>

SELECT "states".* FROM "states"
---
			<div class="form-group">
		    <%= address_fields.collection_select(:state_id, State.all, :id, :name, {prompt: true}, {class: "form-control"}) %>