app/views/carts/edit.html.erb

SELECT "order_contents".* FROM "order_contents" WHERE "order_contents"."order_id" = ?  [["order_id", 3845]]
SELECT SUM(order_contents.quantity * products.price) AS sum_order_contents_quantity_all_products_price, orders.id AS orders_id FROM "orders" INNER JOIN "order_contents" ON "order_contents"."order_id" = "orders"."id" INNER JOIN "products" ON "products"."id" = "order_contents"."product_id" WHERE (orders.id = 3845) GROUP BY orders.id
---

			<% @cart_order.order_contents.each do |item| %>

SELECT "products".* FROM "products" INNER JOIN "order_contents" ON "products"."id" = "order_contents"."product_id" WHERE "order_contents"."order_id" = ?  [["order_id", 3845]]
SELECT COUNT(*) FROM "products" INNER JOIN "order_contents" ON "products"."id" = "order_contents"."product_id" WHERE "order_contents"."order_id" = ?  [["order_id", 3845]]
---

						<% unless @cart_order.products.count == 0 %>