app/views/carts/show.html.erb

						<tbody>
							<% @cart_order.order_contents.each do |order_content| %>
---
SELECT "order_contents".* FROM "order_contents" WHERE "order_contents"."order_id" = ?  [["order_id", 3845]]
SELECT SUM(price * quantity) FROM "orders" INNER JOIN "order_contents" ON "order_contents"."order_id" = "orders"."id" INNER JOIN "products" ON "products"."id" = "order_contents"."product_id" WHERE (orders.id = 3845)