app/controllers/checkouts_controller.rb

UPDATE "users" SET "billing_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["billing_id", 5992], ["updated_at", "2015-07-30 20:52:09.053035"], ["id", 2356]]
UPDATE "orders" SET "checkout_date" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["checkout_date", "2015-07-30 03:49:28.908665"], ["updated_at", "2015-07-30 03:49:28.909411"], ["id", 3845]]
---
	def update
		current_user
		if @current_user.update(whitelisted_checkout_params)
			@cart_order = find_cart(@current_user)
			@cart_order.update(:checkout_date => Time.now.utc)