app/controllers/credit_cards_controller.rb

DELETE FROM "credit_cards" WHERE "credit_cards"."id" = ?  [["id", 1003]]
---
	def destroy
		current_user
		if @current_user.credit_card
			@current_user.credit_card.destroy