app/controllers/dashboard_controller.rb

	def index
		@products = Product.all.paginate(:page => params[:page], :per_page => 9)
---
SELECT  "products".* FROM "products" WHERE (category_id = '208') LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE (category_id = '206')