app/controllers/sessions_controller.rb

	def create
		if User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "me@trevorelwell.co"]]