app/controllers/users_controller.rb

	def create
		if User.new(whitelisted_user_params).valid?
			@user = User.create(whitelisted_user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Mark"], ["last_name", "Seerth"], ["email", "seerth@me.com"], ["created_at", "2015-07-29 01:52:27.061920"], ["updated_at", "2015-07-29 01:52:27.061920"]]

	def update
		current_user
		if @current_user.update(whitelisted_user_params)
---
UPDATE "users" SET "shipping_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["shipping_id", 5956], ["updated_at", "2015-07-29 01:56:32.270707"], ["id", 2340]]

	def destroy
		current_user
		if @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2342]]

	def set_address_ids(user, address, user_params, index)
		# QUESTION: Trying to set the shipping_id and billing_id for this particular user
		# first_address_type
		if index == 0
			address_type = ( user_params[:first_address_type] == "billing" ? :billing_id : :shipping_id )
			new_address = Address.create(:user_id => user.id, :street_address => address[:street_address], :city_id => address[:city_id], :state_id => address[:state_id], :zip_code => address[:zip_code])
			user.update( address_type => new_address.id )
---
INSERT INTO "addresses" ("user_id", "street_address", "city_id", "state_id", "zip_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "shipping_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["shipping_id", 5957], ["updated_at", "2015-07-29 01:52:27.080612"], ["id", 2340]]